var request = require("request");

var keywords = ["西直门","大钟寺","知春路","五道口","上地","西二旗","龙泽","回龙观","霍营","立水桥","望京","芍药居","光熙门","柳芳","东直门","巴沟","苏州街","海淀黄庄","知春里","知春路","西土城","牡丹园","健德门","北土城","安贞门","惠新西街南口","芍药居","太阳宫","三元桥","亮马桥","农业展览馆","团结湖","呼家楼","金台夕照","国贸","双井","劲松","潘家园","十里河","分钟寺","成寿寺","宋家庄","石榴庄","大红门","角门东","角门西","草桥","首经贸","丰台站","泥洼","西局","六里桥","莲花桥","公主坟","西钓鱼台","慈寿寺","车道沟","长春桥","火器营","安河桥北","北宫门","西苑","圆明园","北京大学东门","中关村","海淀黄庄","人民大学","魏公村","国家图书馆","动物园","西直门","新街口","平安里","西四","灵境胡同","西单","宣武门","菜市口","陶然亭","北京南站","马家堡","角门西","公益西桥","新宫","西红门","高米店北","高米店南","枣园","清源路","黄村西大街","黄村火车站","义和庄","生物医药基地","天宫院","天通苑北","天通苑","天通苑南","立水桥","立水桥南","北苑路北","大屯路东","惠新西街北口","惠新西街南口","和平西桥","和平里北街","雍和宫","北新桥","张自忠路","东四","灯市口","东单","崇文门","磁器口","天坛东门","蒲黄榆","刘家窑","宋家庄","回龙观东大街","霍营","育新","西小口","永泰庄","林萃桥","森林公园南门","奥林匹克公园","奥体中心","北土城","安华桥","安德里北街","鼓楼大街","草房","常营","黄渠","褡裢坡","青年路","十里堡","金台路","呼家楼","东大桥","朝阳门","东四","南锣鼓巷","北海北","平安里","车公庄","车公庄西","白石桥南","花园桥","慈寿寺","海淀五路居","国家图书馆","白石桥南","白堆子","北京西站","六里桥东","六里桥","七里庄","丰台东大街","丰台南路","科怡路","丰台科技园","郭公庄","西直门","车公庄","阜成门","复兴门","长椿街","宣武门","和平门","前 门","崇文门","北京站","建国门","朝阳门","东四十条","东直门","雍和宫","安定门","鼓楼大街","积水潭","苹果园","古城路","八角游乐园","八宝山","玉泉路","五棵松","万寿路","公主坟","军事博物馆","木樨地","南礼士路","复兴门","西单","天安门西","天安门东","王府井","东单","建国门","国贸","大望路","四惠","四惠东","南邵","沙河高教园","沙河","巩华城","朱辛庄","生命科学园","西二旗","四惠","四惠东","高碑店","传媒大学","双桥","管庄","八里桥","北苑","果园","九棵树","梨园","临河里","土桥","宋家庄","肖村","小红门","旧宫","亦庄桥","亦庄文化园","万源街","荣京东街","荣昌东街","同济南路","经海路","次渠南","次渠","郭公庄","大葆台","稻田","长阳","篱笆房","广阳城","良乡大学城北","良乡大学城","良乡大学城西","良乡南关","苏庄","东城","西城","海淀","朝阳","丰台","石景山","通州","顺义","房山","大兴","昌平","怀柔","平谷","门头沟","密云","延庆","直租","整租","合租","主卧","次卧","男","女"];

// 前三成热词 后七成冷词
var hot = keywords.slice(0, 79), cold = keywords.slice(80, 268);

var queryRes = {
    "20": {
        total: 0,
        suc: 0
    },    
    "100": {
        total: 0,
        suc: 0
    },    
    "200": {
        total: 0,
        suc: 0
    },    
    "400": {
        total: 0,
        suc: 0
    },
    "8000": {
        total: 0,
        suc: 0
    }        
};

var steps = [
    {
        max: 20,
        round: 2000,
        repeat: 10
    },
    {
        max: 100,
        round: 2000,
        repeat: 10
    },
    {
        max: 200,
        round: 2000,
        repeat: 10
    },
    {
        max: 400,
        round: 2000,
        repeat: 10
    },      
    {
        max: 8000,
        round: 2000,
        repeat: 10
    }     
]

var ping = function (keyword, max) {
    request({
        "Content-type": "application/json",
        "uri": "http://127.0.0.1:8000/query",
        "json": {
            "keyword": keyword,
            "max": max
        }
    }, function(error, res, body) {
        queryRes[max].total++;

        if (res.body.data === 1) {
            queryRes[max].suc++;
        }

        queryRes[max].flag--;
        if (!queryRes[max].flag) {
            console.log("Max: " + max + " Hit Rate------>", queryRes[max].suc / parseFloat(queryRes[max].total));
        }
    });
}


steps.forEach(function (step) {

    // for (var j = 0; j < step.repeat; j++) {
        request({
            "Content-type": "application/json",
            "uri": "http://127.0.0.1:8000/clearRedis"
        }, function (error, res, body) {
            execStep(step.round, step.max);
        }); 
    // } 

});

var execStep = function (round, max) {
    queryRes[max].flag = round;
    for (var i = 0; i < round; i++) {
        var luck = parseInt(Math.random() * 10);

        // 如果为热门词
        if (luck > 3) {
            ping(hot[parseInt(hot.length * Math.random())], max);
        } else {
            ping(cold[parseInt(cold.length * Math.random())], max);
        }
    }
}







// for (var i = 0; i < max; i++) {
//     var luck = parseInt(Math.random() * 10);

//     // 如果为热门词
//     if (luck > 3) {
//         ping(hot[parseInt(hot.length * Math.random())]);
//     } else {
//         ping(cold[parseInt(cold.length * Math.random())]);
//     }
// }